{
  "basics": {
    "name": "Kletz David",
    "email": "david.kletz@supsi.ch",
    "phone": "",
    "website": "https://davkletz.github.io/",
    "summary": "",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Lugano",
      "countryCode": "Switzerland",
      "region": "Ticino"
    },
    "profiles": [
      {
        "network": "Google Scholar",
        "username": "",
        "url": "https://scholar.google.fr/citations?user=9nTkji8AAAAJ&hl=fr&oi=ao"
      },
      {
        "network": "GitHub",
        "username": "davkletz",
        "url": "https://github.com/davkletz"
      }
    ]
  },
  "work": [],
  "education": [
    {
      "institution": "SUPSI",
      "area": "Post-Doc",
      "studyType": "",
      "startDate": "Feb. 2025",
      "endDate": "",
      "gpa": null,
      "courses": []
    },
    {
      "institution": "LLF (CNRS, Université de Paris), Lattice (CNRS, ENS-PSL, Sorbonne-Nouvelle)",
      "area": "Ph.D in NLP",
      "studyType": "",
      "startDate": "Nov. 2021",
      "endDate": "Dec. 2024",
      "gpa": null,
      "courses": []
    },
    {
      "institution": "UdeM (Montreal University)",
      "area": "MsC in Computer Science, AI track",
      "studyType": "",
      "startDate": "Sept. 2019",
      "endDate": "Aug. 2021",
      "gpa": null,
      "courses": []
    }
  ],
  "skills": [],
  "languages": [],
  "interests": [],
  "references": [],
  "publications": [
    {
      "name": "Polarity inversion operators in PLM",
      "Venue": "CoNLL",
      "releaseDate": "2025-07",
      "website": "https://academicpages.github.io/files/2025.conll-1.20.pdf",
      "summary": "From a linguistic perspective, negation is a unique and inherently compositional operator. In this study, we investigate whether the bert-large-cased Pretrained Language Model (PLM) properly encodes this compositional aspect of negation when embedding a token that falls within the scope of negation.To explore this, we train two external Multi-Layer Perceptrons to modify contextual embeddings in a controlled manner. The goal is to reverse the polarity information encoded in the embedding while preserving all other token-related information. The first MLP, called the Negator, transforms a negative polarity into a positive one, while the second, the Affirmator, performs the reverse transformation.We then conduct a series of evaluations to assess the effectiveness of these operators. Our results indicate that while the Negator/Affirmator is functional, it only partially simulates the negation operator. Specifically, applying it recursively does not allow us to recover the original polarity, suggesting an incomplete representation of negation within the PLM’s embeddings.In addition, a downstream evaluation on the Negated LAMA dataset reveals that the modifications introduced by the Negator/Affirmator lead to a slight improvement in the model’s ability to account for negation in its predictions. However, applying the Negator/Affirmator recursively results in degraded representations, further reinforcing the idea that negation is not fully compositional within PLM embeddings."
    },
    
  ],
  "presentations": [
    {
      "name": "Talk 1 on Relevant Topic in Your Field",
      "event": "UC San Francisco, Department of Testing",
      "date": "2012-03-01",
      "location": "San Francisco, CA, USA",
      "description": ""
    },
    
  ]
}
